app/Controllers/AuthController.php

SELECT *
FROM `t_users`
WHERE `nia` = 'KSR.22.177.TPFalfi'
 LIMIT 1
---
    public function LoginAction()
    {
        $users = new UsersModel();
        $nia = $this->request->getVar('nia');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'nia' => $nia,
        ])->first();